## Load Data from https://github.com/CSSEGISandData/COVID-19
#### Syed Mehedi Hasan, Mobile: 0433441366, Email:syedmehedi@yahoo.com

In [489]:
import pandas as pd
url_raw='https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_deaths_global.csv'
df = pd.read_csv(url_raw)
df.head()

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,3/27/20,3/28/20,3/29/20,3/30/20,3/31/20,4/1/20,4/2/20,4/3/20,4/4/20,4/5/20
0,NaN,Afghanistan,33.0000,65.0000,0,0,0,0,0,0,...,4,4,4,4,4,4,6,6,7,7
1,NaN,Albania,41.1533,20.1683,0,0,0,0,0,0,...,8,10,10,11,15,15,16,17,20,20
2,NaN,Algeria,28.0339,1.6596,0,0,0,0,0,0,...,26,29,31,35,44,58,86,105,130,152
3,NaN,Andorra,42.5063,1.5218,0,0,0,0,0,0,...,3,3,6,8,12,14,15,16,17,18
4,NaN,Angola,-11.2027,17.8739,0,0,0,0,0,0,...,0,0,2,2,2,2,2,2,2,2

In [490]:
# dropping passed columns 
df.drop(["Province/State", "Lat","Long"], axis = 1, inplace = True) 
#print(df.dtypes)

In [491]:
#Show Column names that will go vertical
date_columns=df.columns[1:]
print(date_columns)

Index(['1/22/20', '1/23/20', '1/24/20', '1/25/20', '1/26/20', '1/27/20',
       '1/28/20', '1/29/20', '1/30/20', '1/31/20', '2/1/20', '2/2/20',
       '2/3/20', '2/4/20', '2/5/20', '2/6/20', '2/7/20', '2/8/20', '2/9/20',
       '2/10/20', '2/11/20', '2/12/20', '2/13/20', '2/14/20', '2/15/20',
       '2/16/20', '2/17/20', '2/18/20', '2/19/20', '2/20/20', '2/21/20',
       '2/22/20', '2/23/20', '2/24/20', '2/25/20', '2/26/20', '2/27/20',
       '2/28/20', '2/29/20', '3/1/20', '3/2/20', '3/3/20', '3/4/20', '3/5/20',
       '3/6/20', '3/7/20', '3/8/20', '3/9/20', '3/10/20', '3/11/20', '3/12/20',
       '3/13/20', '3/14/20', '3/15/20', '3/16/20', '3/17/20', '3/18/20',
       '3/19/20', '3/20/20', '3/21/20', '3/22/20', '3/23/20', '3/24/20',
       '3/25/20', '3/26/20', '3/27/20', '3/28/20', '3/29/20', '3/30/20',
       '3/31/20', '4/1/20', '4/2/20', '4/3/20', '4/4/20', '4/5/20'],
      dtype='object')

In [492]:
#Show data after before Transform
print(df.shape)
df.head()

(262, 76)

,Country/Region,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,1/28/20,1/29/20,1/30/20,...,3/27/20,3/28/20,3/29/20,3/30/20,3/31/20,4/1/20,4/2/20,4/3/20,4/4/20,4/5/20
0,Afghanistan,0,0,0,0,0,0,0,0,0,...,4,4,4,4,4,4,6,6,7,7
1,Albania,0,0,0,0,0,0,0,0,0,...,8,10,10,11,15,15,16,17,20,20
2,Algeria,0,0,0,0,0,0,0,0,0,...,26,29,31,35,44,58,86,105,130,152
3,Andorra,0,0,0,0,0,0,0,0,0,...,3,3,6,8,12,14,15,16,17,18
4,Angola,0,0,0,0,0,0,0,0,0,...,0,0,2,2,2,2,2,2,2,2

In [493]:
#Unpivot the DataFrame from wide to long format
df=pd.melt(df, id_vars='Country/Region', value_vars=cols)
print(df.shape)
df.head()

(19388, 3)

  Country/Region variable  value
0    Afghanistan  1/22/20      0
1        Albania  1/22/20      0
2        Algeria  1/22/20      0
3        Andorra  1/22/20      0
4         Angola  1/22/20      0

In [494]:
#Change column labels
df.columns = ['Country', 'Day', 'Death']
df.head()

       Country      Day  Death
0  Afghanistan  1/22/20      0
1      Albania  1/22/20      0
2      Algeria  1/22/20      0
3      Andorra  1/22/20      0
4       Angola  1/22/20      0

In [495]:
#Change data type
df['Country'] = df['Country'].astype('str')
df["Day"] = pd.to_datetime(df["Day"])
print(df.dtypes)
df.head()

Country            object
Day        datetime64[ns]
Death               int64
dtype: object

       Country        Day  Death
0  Afghanistan 2020-01-22      0
1      Albania 2020-01-22      0
2      Algeria 2020-01-22      0
3      Andorra 2020-01-22      0
4       Angola 2020-01-22      0

In [496]:
#Sort data By Country, then by Day(Date)
df.sort_values(by=['Country', 'Day'],ascending=[True,True])
df.tail()

              Country        Day  Death
19383          Malawi 2020-04-04      0
19384  United Kingdom 2020-04-04      0
19385          France 2020-04-04      0
19386     South Sudan 2020-04-04      0
19387  Western Sahara 2020-04-04      0

In [497]:
df_new=pd.DataFrame()
tmp_death=0
last_country=''
last_day=''

for i, row in df.iterrows():
        
        if((last_country==row['Country']) & (last_day==row['Day'])):
            tmp_death +=row['Death']
        else:
            data = {'Country': last_country, 'Day': last_day, 'Death': tmp_death}
            #
            if(last_country!=''):
                df_new=df_new.append(data, ignore_index=True)
            tmp_death =row['Death']
                    
        last_country=row['Country']
        last_day=row['Day']

In [498]:
print(df_new.shape)
df_new.head()

(14059, 3)

       Country        Day  Death
0  Afghanistan 2020-01-22    0.0
1      Albania 2020-01-22    0.0
2      Algeria 2020-01-22    0.0
3      Andorra 2020-01-22    0.0
4       Angola 2020-01-22    0.0

In [499]:
#Sort data By Country, then by Day(Date)
df_new=df_new.sort_values(by=['Country', 'Day'],ascending=[True,True])
df_new.head()

         Country        Day  Death
0    Afghanistan 2020-01-22    0.0
190  Afghanistan 2020-01-23    0.0
380  Afghanistan 2020-01-24    0.0
570  Afghanistan 2020-01-25    0.0
760  Afghanistan 2020-01-26    0.0

## 3.  Python: Provide code to upload the table from step 3 into an SQL table named deaths_total

In [500]:
import sqlite3
#Create and connect SqlLite Database
conn = sqlite3.connect('dbCovid_19.db')
c = conn.cursor()
#Drop Existing table if any and create Table
c.execute('DROP TABLE deaths_total')
c.execute('CREATE TABLE deaths_total (Country text, Day text, Death real)')
conn.commit()

In [501]:
#Read data from Pandas dataframe and Insert into SQL Table
for i, row in df_new.iterrows():
    country=str(row['Country'])
    day=str(row['Day'])
    death=str(row['Death'])
    str_sql='INSERT INTO deaths_total(Country, Day, Death) VALUES ("' + country + '", date("' + day + '"), ' + death + ')'
    c.execute(str_sql)

In [502]:
#Select data from SQL table and append to python list
data=c.execute('SELECT * FROM deaths_total')
c.execute('SELECT * FROM deaths_total')
lst_data=[]
for row in c.fetchall():
    lst_data.append(row)
    #print (row)
#conn.close()

In [503]:
#conn.close()

In [504]:
len(lst_data)

14059

In [505]:
lst_data[:4]

[('Afghanistan', '2020-01-22', 0.0),
 ('Afghanistan', '2020-01-23', 0.0),
 ('Afghanistan', '2020-01-24', 0.0),
 ('Afghanistan', '2020-01-25', 0.0)]

## 4.  Python: From the data in step 2, calculate the daily change in deaths for each country

In [506]:
#df_new=df_new[1:]
df_new.head()
df_new=df_new.sort_values(by=['Country', 'Day'],ascending=[True,True])
df_new.head()

         Country        Day  Death
0    Afghanistan 2020-01-22    0.0
190  Afghanistan 2020-01-23    0.0
380  Afghanistan 2020-01-24    0.0
570  Afghanistan 2020-01-25    0.0
760  Afghanistan 2020-01-26    0.0

In [507]:
df_country=df_new
df_change=pd.DataFrame()
last_death=0
last_country=''
last_day=''
tmp_change=0
df_country['Death_Change']=0;
data1 = {'Country': last_country, 'Day': last_day, 'Death': tmp_death,'Death_Change':tmp_change}
#df_new = pd.DataFrame(data1)

k=0;

for i, row in df_country.iterrows():
    
        if k==0:
            last_country=row['Country']
            k +=1;
            
            
        #same country but next day    
        if(last_country==row['Country']):
            tmp_change =row['Death']-last_death
            last_country=row['Country']
            last_day=row['Day']
            last_death=row['Death']
            data = {'Country': last_country, 'Day': last_day, 'Death': last_death,'Death_Change':tmp_change}
            df_change=df_change.append(data, ignore_index=True)
            #print('If: ',tmp_change, last_death, last_country,row['Country'],last_country==row['Country'])
        else:
            tmp_change=0
            last_country=row['Country']
            last_day=row['Day']
            last_death=row['Death']
            #tmp_change =row['Death']-tmp_change
            #print('Else: ',tmp_change, last_death, last_country,row['Country'],last_country==row['Country'])
            
            data = {'Country': last_country, 'Day': last_day, 'Death': last_death,'Death_Change':tmp_change}
            df_change=df_change.append(data, ignore_index=True)
            tmp_death =row['Death']
            #print(last_country, last_day)

In [508]:
print(df_new.shape)
df_change.tail()

(14059, 4)

        Country        Day  Death  Death_Change
14054  Zimbabwe 2020-03-31    1.0           0.0
14055  Zimbabwe 2020-04-01    1.0           0.0
14056  Zimbabwe 2020-04-02    1.0           0.0
14057  Zimbabwe 2020-04-03    1.0           0.0
14058  Zimbabwe 2020-04-04    1.0           0.0

## 5.  Python: Provide code to upload the table from step 4 into an SQL table named deaths_change_python

In [509]:
#conn = sqlite3.connect('Covid_19.db')
#c = conn.cursor()
c.execute('DROP TABLE deaths_change_python')
c.execute('CREATE TABLE deaths_change_python (Country text, Day text, Death numeric, Death_Change numeric)')
conn.commit()

In [510]:
#Read data from Pandas dataframe and Insert into SQL Table
for i, row in df_change.iterrows():
    country=str(row['Country'])
    day=str(row['Day'])
    death=str(row['Death'])
    death_change=str(row['Death_Change'])
    str_sql_change='INSERT INTO deaths_change_python(Country, Day, Death, Death_Change) VALUES ("' + country + '", date("' + day + '"), ' + death + ', ' + death_change + ')'
    c.execute(str_sql_change)

In [511]:
#Select data from SQL table and append to python list
data=c.execute('SELECT * FROM deaths_change_python')
c.execute('SELECT * FROM deaths_change_python')
lst_data=[]
for row in c.fetchall():
    lst_data.append(row)

In [512]:
#Show number of records in list and first ten China data from list
print(len(lst_data))
lst_data_china=[]
lst_data[:10]
for i in lst_data:
    if i[0]=='China':
        lst_data_china.append(i)
lst_data_china[:10]

14059

[('China', '2020-01-22', 17, 0),
 ('China', '2020-01-23', 18, 1),
 ('China', '2020-01-24', 26, 8),
 ('China', '2020-01-25', 42, 16),
 ('China', '2020-01-26', 56, 14),
 ('China', '2020-01-27', 82, 26),
 ('China', '2020-01-28', 131, 49),
 ('China', '2020-01-29', 133, 2),
 ('China', '2020-01-30', 171, 38),
 ('China', '2020-01-31', 213, 42)]

## 6. SQL: Provide SQL code to calculate the daily change for each country using only the data from deaths_total and save it into an SQL table named deaths_change_sql

### Show data from pandas DataFrame

In [513]:
#Print data from pandas Dataframe. I showed here only china data as many 
#Countries do not have enough death to show change in death
print(df_change.shape)
df_china=df_change[df_change['Country']=='China']
df_china.head()

(14059, 4)

     Country        Day  Death  Death_Change
2886   China 2020-01-22   17.0           0.0
2887   China 2020-01-23   18.0           1.0
2888   China 2020-01-24   26.0           8.0
2889   China 2020-01-25   42.0          16.0
2890   China 2020-01-26   56.0          14.0

In [514]:
df_new.to_csv("deaths_total.csv")

In [515]:
c.execute('DROP TABLE deaths_change_sql')
c.execute('CREATE TABLE deaths_change_sql (Country text, Day text, Death numeric, Death_Change numeric)')
conn.commit()

In [516]:
'''Use SQL table death_total, use data from there and calculate daily change for each country using only the 
data from deaths_total and save it into an SQL table named deaths_change_sql
'''
str_sql_change='INSERT INTO deaths_change_sql (Country, Day, Death, Death_Change) SELECT   Country, Day, Death, CASE WHEN (Death - LAG(Death, 1, 0) OVER (ORDER BY Country, Day)) < 0 THEN 0 ELSE (Death - LAG(Death, 1, 0) OVER (ORDER BY Country, Day)) END AS Death_Change FROM deaths_total'
c.execute(str_sql_change)
#Filter to show China data only
c.execute('SELECT * FROM deaths_change_sql where Country="China"')
lst_data_sql=[]
for row in c.fetchall():
    lst_data_sql.append(row)

### Show data from SQLLite Table

In [517]:
#Show number of records in list and ten items from list (from) showing China data only.
print(len(lst_data_sql))
lst_data_sql[:10]

74

[('China', '2020-01-22', 17, 0),
 ('China', '2020-01-23', 18, 1),
 ('China', '2020-01-24', 26, 8),
 ('China', '2020-01-25', 42, 16),
 ('China', '2020-01-26', 56, 14),
 ('China', '2020-01-27', 82, 26),
 ('China', '2020-01-28', 131, 49),
 ('China', '2020-01-29', 133, 2),
 ('China', '2020-01-30', 171, 38),
 ('China', '2020-01-31', 213, 42)]

In [518]:
c.execute('SELECT * FROM deaths_total')
lst_data_total=[]
for row in c.fetchall():
    lst_data_total.append(row)
    #print (row)
#conn.close()

In [519]:
len(lst_data), len(lst_data_sql)

(14059, 74)

## Close connection to the Database

In [520]:
conn.close()

In [521]:
print(df_new.shape, df_change.shape)

(14059, 4) (14059, 4)